In [26]:
pip install pymysql sqlalchemy

Requirement already satisfied: pymysql in c:\anaconda\lib\site-packages (1.1.2)
Requirement already satisfied: sqlalchemy in c:\anaconda\lib\site-packages (2.0.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\anaconda\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\anaconda\lib\site-packages (from sqlalchemy) (4.12.2)
Note: you may need to restart the kernel to use updated packages.

In [71]:
import pandas as pd
from sqlalchemy import create_engine,text

# Create connection engine
engine = create_engine("mysql+pymysql://root:Phani%401997@localhost:3306/telco_chrun")

In [72]:
tables = pd.read_sql("SHOW TABLES;", engine)
print(tables)

  Tables_in_telco_chrun
0       telco_customers

In [73]:
with open("C:\\Users\\ADMIN\\Documents\\Data Analytics_Projects\\Telco Customer Chrun_Project 2\\telco SQL Scripts.sql", "r") as file:
    sql_script = file.read()

In [35]:
query = """
-- Churned Customers
SELECT COUNT(*) AS churned_customers
FROM telco_customers
WHERE Churn = 'Yes';
"""

df = pd.read_sql(query, engine)
df

   churned_customers
0               1869

In [43]:
query = """
-- Churn Rate
SELECT 
    ROUND( (SUM(CASE WHEN Churn = 'Yes' THEN 1 ELSE 0 END) / COUNT(*)) * 100, 2) AS churn_rate
FROM telco_customers;
"""
df= pd.read_sql(query,engine)
df

   churn_rate
0       26.54

In [44]:
query = """
-- Churn by Contract Type
SELECT Contract, 
       COUNT(*) AS total_customers,
       SUM(CASE WHEN Churn = 'Yes' THEN 1 ELSE 0 END) AS churned_customers,
       ROUND( (SUM(CASE WHEN Churn = 'Yes' THEN 1 ELSE 0 END) / COUNT(*)) * 100, 2) AS churn_rate
FROM telco_customers
GROUP BY Contract;
"""
df= pd.read_sql(query,engine)
df

         Contract  total_customers  churned_customers  churn_rate
0  Month-to-month             3875             1655.0       42.71
1        One year             1473              166.0       11.27
2        Two year             1695               48.0        2.83

In [45]:
query = """
-- Churn by Payment Method
SELECT PaymentMethod, 
       COUNT(*) AS total_customers,
       SUM(CASE WHEN Churn = 'Yes' THEN 1 ELSE 0 END) AS churned_customers,
       ROUND( (SUM(CASE WHEN Churn = 'Yes' THEN 1 ELSE 0 END) / COUNT(*)) * 100, 2) AS churn_rate
FROM telco_customers
GROUP BY PaymentMethod
ORDER BY churn_rate DESC;
"""
df= pd.read_sql(query,engine)
df

               PaymentMethod  total_customers  churned_customers  churn_rate
0           Electronic check             2365             1071.0       45.29
1               Mailed check             1612              308.0       19.11
2  Bank transfer (automatic)             1544              258.0       16.71
3    Credit card (automatic)             1522              232.0       15.24

In [46]:
query = """
-- Churn by Tenure Group
SELECT 
    CASE 
        WHEN tenure BETWEEN 0 AND 12 THEN '0-1 Year'
        WHEN tenure BETWEEN 13 AND 24 THEN '1-2 Years'
        WHEN tenure BETWEEN 25 AND 48 THEN '2-4 Years'
        WHEN tenure BETWEEN 49 AND 72 THEN '4-6 Years'
    END AS tenure_group,
    COUNT(*) AS total_customers,
    SUM(CASE WHEN Churn = 'Yes' THEN 1 ELSE 0 END) AS churned_customers,
    ROUND((SUM(CASE WHEN Churn = 'Yes' THEN 1 ELSE 0 END) / COUNT(*)) * 100, 2) AS churn_rate
FROM telco_customers
GROUP BY tenure_group
ORDER BY tenure_group;
"""
df= pd.read_sql(query,engine)
df

  tenure_group  total_customers  churned_customers  churn_rate
0     0-1 Year             2186             1037.0       47.44
1    1-2 Years             1024              294.0       28.71
2    2-4 Years             1594              325.0       20.39
3    4-6 Years             2239              213.0        9.51

In [47]:
query = """
-- High Monthly Charges & Churn
SELECT 
    CASE 
        WHEN MonthlyCharges < 35 THEN 'Low (<$35)'
        WHEN MonthlyCharges BETWEEN 35 AND 70 THEN 'Medium ($35-$70)'
        ELSE 'High (>$70)'
    END AS charges_group,
    COUNT(*) AS total_customers,
    SUM(CASE WHEN Churn = 'Yes' THEN 1 ELSE 0 END) AS churned_customers,
    ROUND((SUM(CASE WHEN Churn = 'Yes' THEN 1 ELSE 0 END) / COUNT(*)) * 100, 2) AS churn_rate
FROM telco_customers
GROUP BY charges_group;
"""
df= pd.read_sql(query,engine)
df

      charges_group  total_customers  churned_customers  churn_rate
0        Low (<$35)             1731              188.0       10.86
1  Medium ($35-$70)             1729              414.0       23.94
2       High (>$70)             3583             1267.0       35.36

In [80]:
check_query = """
SELECT COLUMN_NAME 
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_SCHEMA = 'telco_chrun' 
AND TABLE_NAME = 'telco_customers';
"""

columns = pd.read_sql(check_query, engine)

if "PartnerFlag" not in columns["COLUMN_NAME"].values:
    with engine.connect() as conn:
        conn.execute("ALTER TABLE telco_customers ADD COLUMN PartnerFlag TINYINT AFTER Partner;")
else:
    print("✅ PartnerFlag column already exists, skipping...")
    
    update_query = text("""
UPDATE telco_customers
SET PartnerFlag = CASE 
    WHEN Partner = 'Yes' THEN 1 
    ELSE 0 
END;
""")

with engine.begin() as conn:   
    conn.execute(update_query)

print("✅ PartnerFlag updated successfully")

✅ PartnerFlag column already exists, skipping...
✅ PartnerFlag updated successfully

In [88]:
check_query = """
SELECT COLUMN_NAME 
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_SCHEMA = 'telco_chrun' 
AND TABLE_NAME = 'telco_customers';
"""

columns = pd.read_sql(check_query, engine)

if "DependentsFlag" not in columns["COLUMN_NAME"].values:
    with engine.connect() as conn:
        conn.execute("ALTER TABLE telco_customers ADD COLUMN DependentsFlag TINYINT AFTER Dependents;")
else:
    print("✅ DependentsFlag column already exists, skipping...")

    update_query = text("""
UPDATE telco_customers
SET DependentsFlag = CASE 
    WHEN Dependents = 'Yes' THEN 1 
    ELSE 0 
END;
""")

with engine.begin() as conn:   
    conn.execute(update_query)

print("✅ DependentsFlag updated successfully")

✅ DependentsFlag column already exists, skipping...
✅ DependentsFlag updated successfully

In [89]:
check_query = """
SELECT COLUMN_NAME 
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_SCHEMA = 'telco_chrun' 
AND TABLE_NAME = 'telco_customers';
"""
columns = pd.read_sql(check_query, engine)


if "ChurnFlag" not in columns["COLUMN_NAME"].values:
    with engine.begin() as conn:
        conn.execute(text("ALTER TABLE telco_customers ADD COLUMN ChurnFlag TINYINT AFTER Churn;"))
    print("✅ ChurnFlag column added")
else:
    print("⚠️ ChurnFlag column already exists, skipping add")


update_query = text("""
UPDATE telco_customers
SET ChurnFlag = CASE 
    WHEN Churn = 'Yes' THEN 1 
    ELSE 0 
END;
""")

with engine.begin() as conn:   
    conn.execute(update_query)

print("✅ ChurnFlag updated successfully")

⚠️ ChurnFlag column already exists, skipping add
✅ ChurnFlag updated successfully

In [91]:
check_query = """
SELECT COLUMN_NAME 
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_SCHEMA = 'telco_chrun' 
AND TABLE_NAME = 'telco_customers';
"""
columns = pd.read_sql(check_query, engine)


if "PhoneServiceFlag" not in columns["COLUMN_NAME"].values:
    with engine.begin() as conn:
        conn.execute(text("ALTER TABLE telco_customers ADD COLUMN PhoneServiceFlag TINYINT AFTER PhoneService;"))
    print("✅ PhoneServiceFlag column added")
else:
    print("⚠️ PhoneServiceFlag column already exists, skipping add")


update_query = text("""
UPDATE telco_customers
SET PhoneServiceFlag = CASE 
    WHEN PhoneService = 'Yes' THEN 1 
    ELSE 0 
END;
""")

with engine.begin() as conn:   
    conn.execute(update_query)

print("✅ PhoneServiceFlag updated successfully")

✅ PhoneServiceFlag column added
✅ PhoneServiceFlag updated successfully

In [92]:
check_query = """
SELECT COLUMN_NAME 
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_SCHEMA = 'telco_chrun' 
AND TABLE_NAME = 'telco_customers';
"""
columns = pd.read_sql(check_query, engine)


if "PaperLessBillingFlag" not in columns["COLUMN_NAME"].values:
    with engine.begin() as conn:
        conn.execute(text("ALTER TABLE telco_customers ADD COLUMN PaperLessBillingFlag TINYINT AFTER PaperLessBilling;"))
    print("✅ PaperLessBillingFlag column added")
else:
    print("⚠️ PaperLessBillingFlag column already exists, skipping add")


update_query = text("""
UPDATE telco_customers
SET PaperLessBillingFlag = CASE 
    WHEN PaperLessBilling = 'Yes' THEN 1 
    ELSE 0 
END;
""")

with engine.begin() as conn:   
    conn.execute(update_query)

print("✅ PaperLessBillingFlag updated successfully")

✅ PaperLessBillingFlag column added
✅ PaperLessBillingFlag updated successfully

In [101]:
fix_query = text("""
UPDATE telco_customers
SET TotalCharges = NULL
WHERE TotalCharges = '' OR TotalCharges IS NULL;
""")

with engine.begin() as conn:
    conn.execute(fix_query)

print("✅ Empty strings in TotalCharges replaced with NULL")

✅ Empty strings in TotalCharges replaced with NULL

In [103]:
alter_statements = [
    "ALTER TABLE telco_customers MODIFY COLUMN customerID VARCHAR(50);",
    "ALTER TABLE telco_customers MODIFY COLUMN gender VARCHAR(10);",
    "ALTER TABLE telco_customers MODIFY COLUMN SeniorCitizen TINYINT;",
    "ALTER TABLE telco_customers MODIFY COLUMN Partner VARCHAR(3);",
    "ALTER TABLE telco_customers MODIFY COLUMN PartnerFlag TINYINT;",
    "ALTER TABLE telco_customers MODIFY COLUMN Dependents VARCHAR(3);",
    "ALTER TABLE telco_customers MODIFY COLUMN DependentsFlag TINYINT;",
    "ALTER TABLE telco_customers MODIFY COLUMN tenure INT;",
    "ALTER TABLE telco_customers MODIFY COLUMN PhoneService VARCHAR(3);",
    "ALTER TABLE telco_customers MODIFY COLUMN MultipleLines VARCHAR(20);",
    "ALTER TABLE telco_customers MODIFY COLUMN InternetService VARCHAR(20);",
    "ALTER TABLE telco_customers MODIFY COLUMN OnlineSecurity VARCHAR(20);",
    "ALTER TABLE telco_customers MODIFY COLUMN OnlineBackup VARCHAR(20);",
    "ALTER TABLE telco_customers MODIFY COLUMN DeviceProtection VARCHAR(20);",
    "ALTER TABLE telco_customers MODIFY COLUMN TechSupport VARCHAR(20);",
    "ALTER TABLE telco_customers MODIFY COLUMN StreamingTV VARCHAR(20);",
    "ALTER TABLE telco_customers MODIFY COLUMN StreamingMovies VARCHAR(20);",
    "ALTER TABLE telco_customers MODIFY COLUMN Contract VARCHAR(20);",
    "ALTER TABLE telco_customers MODIFY COLUMN PaperlessBilling VARCHAR(3);",
    "ALTER TABLE telco_customers MODIFY COLUMN PaymentMethod VARCHAR(50);",
    "ALTER TABLE telco_customers MODIFY COLUMN MonthlyCharges DECIMAL(10,2);",
    "ALTER TABLE telco_customers MODIFY COLUMN Churn VARCHAR(3);",
    "ALTER TABLE telco_customers MODIFY COLUMN ChurnFlag TINYINT;"
]

with engine.begin() as conn:
    for stmt in alter_statements:
        conn.execute(text(stmt))

In [110]:
fix_totalcharges = text("""
UPDATE telco_customers
SET TotalCharges = NULL
WHERE TRIM(TotalCharges) = '';
""")

with engine.begin() as conn:
    conn.execute(fix_totalcharges)

print("✅ Blank TotalCharges fixed (set to NULL)")

✅ Blank TotalCharges fixed (set to NULL)

In [111]:
with engine.begin() as conn:
    conn.execute(text("ALTER TABLE telco_customers MODIFY COLUMN TotalCharges DECIMAL(10,2);"))

print("✅ TotalCharges converted to DECIMAL(10,2)")

✅ TotalCharges converted to DECIMAL(10,2)

In [112]:
df = pd.read_sql("DESCRIBE telco_customers;", engine)
df

                   Field           Type Null Key Default Extra
0             customerID    varchar(50)  YES        None
1                 gender    varchar(10)  YES        None
2          SeniorCitizen        tinyint  YES        None
3                Partner     varchar(3)  YES        None
4            PartnerFlag        tinyint  YES        None
5             Dependents     varchar(3)  YES        None
6         DependentsFlag        tinyint  YES        None
7                 tenure            int  YES        None
8           PhoneService     varchar(3)  YES        None
9       PhoneServiceFlag        tinyint  YES        None
10         MultipleLines    varchar(20)  YES        None
11       InternetService    varchar(20)  YES        None
12        OnlineSecurity    varchar(20)  YES        None
13          OnlineBackup    varchar(20)  YES        None
14      DeviceProtection    varchar(20)  YES        None
15           TechSupport    varchar(20)  YES        None
16           StreamingTV    varchar(20)  YES        None
17       StreamingMovies    varchar(20)  YES        None
18              Contract    varchar(20)  YES        None
19      PaperlessBilling     varchar(3)  YES        None
20  PaperLessBillingFlag        tinyint  YES        None
21         PaymentMethod    varchar(50)  YES        None
22        MonthlyCharges  decimal(10,2)  YES        None
23          TotalCharges  decimal(10,2)  YES        None
24                 Churn     varchar(3)  YES        None
25             ChurnFlag        tinyint  YES        None

In [105]:
df = pd.read_sql("SELECT * FROM telco_customers LIMIT 10;", engine)
df

,customerID,gender,SeniorCitizen,Partner,PartnerFlag,Dependents,DependentsFlag,tenure,PhoneService,PhoneServiceFlag,...,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaperLessBillingFlag,PaymentMethod,MonthlyCharges,TotalCharges,Churn,ChurnFlag
0,7590-VHVEG,Female,0,Yes,1,No,0,1,No,0,...,No,No,Month-to-month,Yes,1,Electronic check,29.85,29.85,No,0
1,5575-GNVDE,Male,0,No,0,No,0,34,Yes,1,...,No,No,One year,No,0,Mailed check,56.95,1889.5,No,0
2,3668-QPYBK,Male,0,No,0,No,0,2,Yes,1,...,No,No,Month-to-month,Yes,1,Mailed check,53.85,108.15,Yes,1
3,7795-CFOCW,Male,0,No,0,No,0,45,No,0,...,No,No,One year,No,0,Bank transfer (automatic),42.30,1840.75,No,0
4,9237-HQITU,Female,0,No,0,No,0,2,Yes,1,...,No,No,Month-to-month,Yes,1,Electronic check,70.70,151.65,Yes,1
5,9305-CDSKC,Female,0,No,0,No,0,8,Yes,1,...,Yes,Yes,Month-to-month,Yes,1,Electronic check,99.65,820.5,Yes,1
6,1452-KIOVK,Male,0,No,0,Yes,1,22,Yes,1,...,Yes,No,Month-to-month,Yes,1,Credit card (automatic),89.10,1949.4,No,0
7,6713-OKOMC,Female,0,No,0,No,0,10,No,0,...,No,No,Month-to-month,No,0,Mailed check,29.75,301.9,No,0
8,7892-POOKP,Female,0,Yes,1,No,0,28,Yes,1,...,Yes,Yes,Month-to-month,Yes,1,Electronic check,104.80,3046.05,Yes,1
9,6388-TABGU,Male,0,No,0,Yes,1,62,Yes,1,...,No,No,One year,No,0,Bank transfer (automatic),56.15,3487.95,No,0

In [113]:
df_clean = pd.read_sql("SELECT * FROM telco_customers;", engine)
df_clean.to_csv("cleaned_telco_customers.csv", index=False)
print("✅ Saved as cleaned_telco_customers.csv")

✅ Saved as cleaned_telco_customers.csv